Revit 2026 API

# UVUnaryNegation Operator

---

Negates this 2-D vector and returns the result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static UV operator -(
	UV source
)
```
```vb
Public Shared Operator - (
	source As UV
) As UV
```
```cpp
public:
static UV^ operator -(
	UV^ source
)
```
```fsharp
static let inline (-)
        source : UV  : UV
```

#### Parameters

source UV

#### Return Value

UVThe 2-D vector opposite to this vector.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when source is . |

The negated vector is obtained by changing the sign of each coordinate of the specified vector.

#### Reference

UV Class

Autodesk.Revit.DB Namespace